# 병렬 순회: zip과 map

L1 = [1,2,3,4]
L2 = [5,6,7,8]

zip(L1, L2)
# <zip object at 0x7f4080605948>
list(zip(L1, L2))               # 3.X에서는 list로 감싸야 함
# [(1, 5), (2, 6), (3, 7), (4, 8)]


for (x, y) in zip(L1, L2):
    print(x, y, '--', x+y)

# 1 5 -- 6
# 2 6 -- 8
# 3 7 -- 10
# 4 8 -- 12


T1, T2, T3 = (1,2,3), (4,5,6), (7,8,9)
T3
# (7, 8, 9)
list(zip(T1, T2, T3))           # 세 개의 인수에 대한 세 개의 튜플
# [(1, 4, 7), (2, 5, 8), (3, 6, 9)]


S1 = 'abc'
S2 = 'xyz123'

list(zip(S1, S2))               # 짧은 길이에 맞춰 자르기
# [('a', 'x'), ('b', 'y'), ('c', 'z')]
